# DissolveNoValidInputs Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FormFailures..::..DissolveNoValidInputs Property
BuiltInFailures..::..FormFailures Class See Also
---
No form elements selected to dissolve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DissolveNoValidInputs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DissolveNoValidInputs As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DissolveNoValidInputs {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FormFailures Class
Autodesk.Revit.DB Namespace